app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Richell Bonfield"], ["created_at", "2019-12-26 11:21:32.909375"], ["updated_at", "2019-12-26 11:21:32.909375"]]
---
  def create
    Artist.create(artist_params)