app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
  def index
        if @artist = Artist.find_by_id(params[:artist_id])
            @songs = @artist.songs.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def new
        if @artist = Artist.find_by_id(params[:artist_id])

INSERT INTO "songs" ("title", "album_name", "release_year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hello"], ["album_name", "Sunset"], ["release_year", "2005"], ["created_at", "2019-12-23 05:59:43.845076"], ["updated_at", "2019-12-23 05:59:43.845076"]]
---
    def create
        @songs = current_user.songs.build(song_params)
        if @song.save

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def show
        @song = Song.find_by_id(params[:id])